#Section01. 파일처리
## 1. 파이썬에서 파일 처리
### 파일열기 : open 함수

In [1]:
f=open('file.txt', 'rt', encoding='UTF8')
for line in f:
 print(line, end="")

작은 일에 성실한 사람은 큰 일에도 성실하고,
작은 일에 정직하지 못한 사람은 큰 일에도 정직하지 못하다.
누가복음 16:10

변함없이 서로 사랑하는 이가 친구이며
위급할 때 서로 돕는 이가 형제이다.
잠언 17:17

###자동으로 파일 열고 닫기: with 문

In [2]:
with open("proverb.txt",'r', encoding='UTF8', newline='') as filereader:
  for row in filereader:
    print("{}".format(row.strip( )))

작은 일에 성실한 사람은 큰 일에도 성실하고,
작은 일에 정직하지 못한 사람은 큰 일에도 정직하지 못하다.
누가복음 16:10

변함없이 서로 사랑하는 이가 친구이며
위급할 때 서로 돕는 이가 형제이다.
잠언 17:17

###여러 파일 읽기: os와 glob 모듈
- 중요
- 파일 경로 잡기, 파일 찾기 등 예제

In [3]:
import os
import glob
# 다중 csv, excel 파일이 존재할 때, 
# 형식이 똑같다고 전제하면, 하나의 데이터 프레임으로 변환
for file in glob.glob(os.path.join('*.txt')): # 전체 txt 파일 불러옴
  with open(file, 'r', newline='',encoding='UTF8') as filereader:
     for row in filereader:
      print("{}".format(row.strip( )))

작은 일에 성실한 사람은 큰 일에도 성실하고,
작은 일에 정직하지 못한 사람은 큰 일에도 정직하지 못하다.
누가복음 16:10

변함없이 서로 사랑하는 이가 친구이며
위급할 때 서로 돕는 이가 형제이다.
잠언 17:17
안녕하세요
hello
내용을 추가합니다.
저장하는 문서 이름,  'w' 대신 'a'를 사용합니다.
작은 일에 성실한 사람은 큰 일에도 성실하고,
작은 일에 정직하지 못한 사람은 큰 일에도 정직하지 못하다.
누가복음 16:10

변함없이 서로 사랑하는 이가 친구이며
위급할 때 서로 돕는 이가 형제이다.
잠언 17:17

In [4]:
import os
os.getcwd() # 현재 파일 경로

'C:\\Users\\82103\\OneDrive\\바탕 화면\\논문 + 필기 + 대외\\LG U+ Why Not SW Camp 부트캠프\\LGSW_part02\\LGSW02\\chapter6'

### 문자열 공백/문자 제거: strip, lstrip, rstrip 함수

In [5]:
b1=" 작은 일에 성실한 사람은      큰일에도 성실하고 "
b1.strip( ) # 공백 제거

'작은 일에 성실한 사람은      큰일에도 성실하고'

In [6]:
text="....작은 일에 성실한 사람은, 큰일에도 성실하고...."
print(text.lstrip('.'))
print(text.rstrip('.'))
print(text.strip('.'))

작은 일에 성실한 사람은, 큰일에도 성실하고....
....작은 일에 성실한 사람은, 큰일에도 성실하고
작은 일에 성실한 사람은, 큰일에도 성실하고

###문자열 분리: split 함수

In [7]:
text="....작은 일에 성실한 사람은, 큰일에도 성실하고...."
print(text.split(", "))

['....작은 일에 성실한 사람은', '큰일에도 성실하고....']

In [8]:
numbers="1. 2. 3. 4. 5. 6"
result=numbers.split(". ")
print(result)

['1', '2', '3', '4', '5', '6']

###웹 페이지에서 CSV 파일 가져오기

In [9]:
import pandas as pd
titanic_df=pd.read_csv('https://raw.githubusercontent.com/sehakflower/data/main/titanic.csv')
titanic_df

                        PassengerId\tSurvived\tPclass\tName\tSex\tAge\tSibSp\tParch\tTicket\tFare\tCabin\tEmbarked
1\t0\t3\tBraund           Mr. Owen Harris\tmale\t22\t1\t0\tA/5 21171\t7...
2\t1\t1\tCumings          Mrs. John Bradley (Florence Briggs Thayer)\tf...
3\t1\t3\tHeikkinen        Miss. Laina\tfemale\t26\t0\t0\tSTON/O2. 31012...
4\t1\t1\tFutrelle         Mrs. Jacques Heath (Lily May Peel)\tfemale\t3...
5\t0\t3\tAllen            Mr. William Henry\tmale\t35\t0\t0\t373450\t8....
...                                                                    ...
152\t1\t1\tPears          Mrs. Thomas (Edith Wearne)\tfemale\t22\t1\t0\...
153\t0\t3\tMeo            Mr. Alfonzo\tmale\t55.5\t0\t0\tA.5. 11206\t8....
154\t0\t3\tvan Billiard   Mr. Austin Blyler\tmale\t40.5\t0\t2\tA/5. 851...
155\t0\t3\tOlsen          Mr. Ole Martin\tmale\t\t0\t0\tFa 265302\t7.31...
156\t0\t1\tWilliams       Mr. Charles Duane\tmale\t51\t0\t1\tPC 17597\t...

[156 rows x 1 columns]

###탭을 기준으로 분리하기

In [94]:
url='https://raw.githubusercontent.com/sehakflower/data/main/titanic.csv'
titanic_df=pd.read_csv(url,sep='\t')
titanic_df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
151,152,1,1,"Pears, Mrs. Thomas (Edith Wearne)",female,22.0,1,0,113776,66.6000,C2,S
152,153,0,3,"Meo, Mr. Alfonzo",male,55.5,0,0,A.5. 11206,8.0500,NaN,S
153,154,0,3,"van Billiard, Mr. Austin Blyler",male,40.5,0,2,A/5. 851,14.5000,NaN,S
154,155,0,3,"Olsen, Mr. Ole Martin",male,NaN,0,0,Fa 265302,7.3125,NaN,S
155,156,0,1,"Williams, Mr. Charles Duane",male,51.0,0,1,PC 17597,61.3792,NaN,C

###<여기서 잠깐> 데이터 분리하기

In [11]:
print('apple', 'banana')
print('apple', 'banana', sep='')
print('apple', 'banana', sep=' ')
print('apple', 'banana', sep=' ')
print('apple', 'banana', sep=' -> -> ')
print('apple', 'banana','eggs', 'ham')
print('apple', 'banana', 'eggs', 'ham', sep='\t')
print('apple', 'banana','eggs', 'ham', sep='\t\t')

apple banana
applebanana
apple banana
apple banana
apple -> -> banana
apple banana eggs ham
apple	banana	eggs	ham
apple		banana		eggs		ham

###엑셀 파일 가져오기

In [95]:
titanic='https://github.com/sehakflower/data/blob/main/titanic.xlsx?raw=true'
titanic=pd.read_excel(titanic,sheet_name='titanic3')
titanic

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,3,0,"Zabour, Miss. Hileni",female,14.5000,1,0,2665,14.4542,NaN,C,NaN,328.0,NaN
1305,3,0,"Zabour, Miss. Thamine",female,NaN,1,0,2665,14.4542,NaN,C,NaN,NaN,NaN
1306,3,0,"Zakarian, Mr. Mapriededer",male,26.5000,0,0,2656,7.2250,NaN,C,NaN,304.0,NaN
1307,3,0,"Zakarian, Mr. Ortin",male,27.0000,0,0,2670,7.2250,NaN,C,NaN,NaN,NaN
1308,3,0,"Zimmerman, Mr. Leo",male,29.0000,0,0,315082,7.8750,NaN,S,NaN,NaN,NaN

#Section 02. 데이터 처리
## 1. 데이터 살펴보기
### 앞뒤 데이터 보기: head, tail 함수

In [13]:
titanic_df.head(7)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S

In [14]:
titanic_df.tail(7)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
149,150,0,2,"Byles, Rev. Thomas Roussel Davids",male,42.0,0,0,244310,13.0000,NaN,S
150,151,0,2,"Bateman, Rev. Robert James",male,51.0,0,0,S.O.P. 1166,12.5250,NaN,S
151,152,1,1,"Pears, Mrs. Thomas (Edith Wearne)",female,22.0,1,0,113776,66.6000,C2,S
152,153,0,3,"Meo, Mr. Alfonzo",male,55.5,0,0,A.5. 11206,8.0500,NaN,S
153,154,0,3,"van Billiard, Mr. Austin Blyler",male,40.5,0,2,A/5. 851,14.5000,NaN,S
154,155,0,3,"Olsen, Mr. Ole Martin",male,NaN,0,0,Fa 265302,7.3125,NaN,S
155,156,0,1,"Williams, Mr. Charles Duane",male,51.0,0,1,PC 17597,61.3792,NaN,C

###데이터 개수/형태 확인하기: len/shape 함수

In [15]:
len(titanic_df) # 데이터 행의 개수

156

In [16]:
titanic_df.shape

(156, 12)

###데이터의 기본 통계치 보기: describe 함수

In [17]:
titanic_df.describe( )

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,156.000000,156.000000,156.000000,126.000000,156.000000,156.000000,156.000000
mean,78.500000,0.346154,2.423077,28.141508,0.615385,0.397436,28.109587
std,45.177428,0.477275,0.795459,14.613880,1.056235,0.870146,39.401047
min,1.000000,0.000000,1.000000,0.830000,0.000000,0.000000,6.750000
25%,39.750000,0.000000,2.000000,19.000000,0.000000,0.000000,8.003150
50%,78.500000,0.000000,3.000000,26.000000,0.000000,0.000000,14.454200
75%,117.250000,1.000000,3.000000,35.000000,1.000000,0.000000,30.371850
max,156.000000,1.000000,3.000000,71.000000,5.000000,5.000000,263.000000

###결측치와 데이터형 확인하기: info 함수

In [18]:
titanic_df.info( ) # 반드시 거쳐가는 데이터 확인 방법

# non null count를 보면 총 156개의 entries가 있지만,
# 숫자가 더 적은 게 존재 == 결측치 존재

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 156 entries, 0 to 155
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  156 non-null    int64
 1   Survived     156 non-null    int64
 2   Pclass       156 non-null    int64
 3   Name         156 non-null    object
 4   Sex          156 non-null    object
 5   Age          126 non-null    float64
 6   SibSp        156 non-null    int64
 7   Parch        156 non-null    int64
 8   Ticket       156 non-null    object
 9   Fare         156 non-null    float64
 10  Cabin        31 non-null     object
 11  Embarked     155 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 14.8+ KB

In [19]:
## 결측치와 데이터형 확인하기 == info 함수

"""
결측치가 존재한다면
1) 삭제
2) 그대로
    값을 어떻게 채울까가 핵심

결측치를 처리한다는 면접자가 질문함.
' 왜 그렇게 처리? ' -> 스토리텔링
"""

"\n결측치가 존재한다면\n1) 삭제\n2) 그대로\n    값을 어떻게 채울까가 핵심\n\n결측치를 처리한다는 면접자가 질문함.\n' 왜 그렇게 처리? ' -> 스토리텔링\n"

##2. 열/행 정리하기
###열 이름 변경하기

In [20]:
titanic_df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [96]:
new_columns=['passengerId', 'survived', 'pclass', 'name', 'sex', 'age', 'sibsp', 'parch',
'ticket', 'fare', 'cabin', 'embarked']
titanic_df.columns=new_columns
titanic_df.columns

Index(['passengerId', 'survived', 'pclass', 'name', 'sex', 'age', 'sibsp',
       'parch', 'ticket', 'fare', 'cabin', 'embarked'],
      dtype='object')

In [22]:
titanic_df

,passengerId,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
151,152,1,1,"Pears, Mrs. Thomas (Edith Wearne)",female,22.0,1,0,113776,66.6000,C2,S
152,153,0,3,"Meo, Mr. Alfonzo",male,55.5,0,0,A.5. 11206,8.0500,NaN,S
153,154,0,3,"van Billiard, Mr. Austin Blyler",male,40.5,0,2,A/5. 851,14.5000,NaN,S
154,155,0,3,"Olsen, Mr. Ole Martin",male,NaN,0,0,Fa 265302,7.3125,NaN,S
155,156,0,1,"Williams, Mr. Charles Duane",male,51.0,0,1,PC 17597,61.3792,NaN,C

###데이터프레임 복사하기

In [23]:
## 분석 프로젝트 진행 시 copy 함수 적절하게 사용할 것
## 데이터 조작, 핸들링, 원본 자체가 업데이트 될 수 있음
## 분석 단계 -> 수집단계 / 가공단계 / 시각화 분석 단계 / 모델링 단계

copy_titanic_df=titanic_df.copy( )
copy_titanic_df.head( )

,passengerId,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

###행 추가하기

In [24]:
copy_titanic_df.append({'passengerId':1, 'survived':1, 'pclass':1, 'name':1, 'sex':1, 
                        'age':1, 'sibsp':1, 'parch':1, 'ticket':1, 'fare':1, 'cabin':1,
                        'embarked':1}, ignore_index=True) # dataframe엔 append 함수가 없음

AttributeError: 'DataFrame' object has no attribute 'append'

In [25]:
new_df = pd.DataFrame({'passengerId':[1], 'survived':[1], 'pclass':[1], 'name':[1], 'sex':[1],
'age':[1], 'sibsp':[1], 'parch':[1], 'ticket':[1], 'fare':[1], 'cabin':[1],
'embarked':[1]})
#                           새로운 데이터 프레임
pd.concat([copy_titanic_df, new_df])

,passengerId,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
152,153,0,3,"Meo, Mr. Alfonzo",male,55.5,0,0,A.5. 11206,8.0500,NaN,S
153,154,0,3,"van Billiard, Mr. Austin Blyler",male,40.5,0,2,A/5. 851,14.5000,NaN,S
154,155,0,3,"Olsen, Mr. Ole Martin",male,NaN,0,0,Fa 265302,7.3125,NaN,S
155,156,0,1,"Williams, Mr. Charles Duane",male,51.0,0,1,PC 17597,61.3792,NaN,C
0,1,1,1,1,1,1.0,1,1,1,1.0000,1,1

In [26]:
copy_titanic_df = pd.concat([copy_titanic_df, pd.DataFrame([{'passengerId':1, 'survived':1, 'pclass':1, 'name':1, 'sex':1, 
                        'age':1, 'sibsp':1, 'parch':1, 'ticket':1, 'fare':1, 'cabin':1,
                        'embarked':1}])], ignore_index=True)

In [27]:
## concat 함수 사용법

import pandas as pd
df1 = pd.DataFrame({
    'A': ['A0', 'A1', 'A2'],
    'B': ['B0', 'B1', 'B2']
})

df2 = pd.DataFrame({
    'A': ['A3', 'A4', 'A5'],
    'B': ['B3', 'B4', 'B5']
})

pd.concat([df1, df2])

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
0  A3  B3
1  A4  B4
2  A5  B5

In [28]:
## concat 함수 사용법

import pandas as pd
df1 = pd.DataFrame({
    'A': ['A0', 'A1', 'A2'],
    'B': ['B0', 'B1', 'B2']
})

df2 = pd.DataFrame({
    'A': ['A3', 'A4', 'A5'],
    'B': ['B3', 'B4', 'B5'],
     # 매칭이 안되면 결측치가 생긴다.
    'C': ['C3', 'C4', 'C5']
})

pd.concat([df1, df2])

    A   B    C
0  A0  B0  NaN
1  A1  B1  NaN
2  A2  B2  NaN
0  A3  B3   C3
1  A4  B4   C4
2  A5  B5   C5

In [29]:
## concat 함수 사용법

import pandas as pd
df1 = pd.DataFrame({
    'A': ['A0', 'A1', 'A2'],
    'B': ['B0', 'B1', 'B2']
})

df2 = pd.DataFrame({
    'A': ['A3', 'A4'],
    'B': ['B3', 'B4']
})

pd.concat([df1, df2])

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
0  A3  B3
1  A4  B4

In [30]:
copy_titanic_df.tail( ) # 기억

,passengerId,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
152,153,0,3,"Meo, Mr. Alfonzo",male,55.5,0,0,A.5. 11206,8.0500,NaN,S
153,154,0,3,"van Billiard, Mr. Austin Blyler",male,40.5,0,2,A/5. 851,14.5000,NaN,S
154,155,0,3,"Olsen, Mr. Ole Martin",male,NaN,0,0,Fa 265302,7.3125,NaN,S
155,156,0,1,"Williams, Mr. Charles Duane",male,51.0,0,1,PC 17597,61.3792,NaN,C
156,1,1,1,1,1,1.0,1,1,1,1.0000,1,1

In [31]:
copy_titanic_df=copy_titanic_df.append({'passengerId':1, 'survived':1, 'pclass':1,
'name':1, 'sex':1, 'age':1, 'sibsp':1, 'parch':1, 'ticket':1, 'fare':1, 'cabin':1,
'embarked':1}, ignore_index=True)
copy_titanic_df.tail( )

AttributeError: 'DataFrame' object has no attribute 'append'

###열 추가하기

In [32]:
copy_titanic_df['gender']=1
copy_titanic_df.tail( )

,passengerId,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,gender
152,153,0,3,"Meo, Mr. Alfonzo",male,55.5,0,0,A.5. 11206,8.0500,NaN,S,1
153,154,0,3,"van Billiard, Mr. Austin Blyler",male,40.5,0,2,A/5. 851,14.5000,NaN,S,1
154,155,0,3,"Olsen, Mr. Ole Martin",male,NaN,0,0,Fa 265302,7.3125,NaN,S,1
155,156,0,1,"Williams, Mr. Charles Duane",male,51.0,0,1,PC 17597,61.3792,NaN,C,1
156,1,1,1,1,1,1.0,1,1,1,1.0000,1,1,1

In [33]:
copy_titanic_df.loc[copy_titanic_df['sex']=='female', 'gender'].head(5)

1    1
2    1
3    1
8    1
9    1
Name: gender, dtype: int64

In [34]:
## 새로운 컬럼을 추가하는 방식

# 기본 조건필터
# copy_titanic_df.loc[copy_titanic_df['sex']=='female', :].head(5)

## 인코딩 변환 코드
## 수학 공식에서 문자열은 작동 x
## but, 문자열을 활용하고 싶을 경우 == 변환이 필요

# 여성일 경우에 0을 넣어라. (gender 열을 만들고)
copy_titanic_df.loc[copy_titanic_df['sex']=='female', 'gender']=0
copy_titanic_df.head( )

,passengerId,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,gender
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,0
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,1

##3. 인덱스 정리하기
###index 속성

In [35]:
titanic_df.index

RangeIndex(start=0, stop=156, step=1)

###values 속성

In [36]:
## 데이터프레임은 이차원임
titanic_df.values

array([[1, 0, 3, ..., 7.25, nan, 'S'],
       [2, 1, 1, ..., 71.2833, 'C85', 'C'],
       [3, 1, 3, ..., 7.925, nan, 'S'],
       ...,
       [154, 0, 3, ..., 14.5, nan, 'S'],
       [155, 0, 3, ..., 7.3125, nan, 'S'],
       [156, 0, 1, ..., 61.3792, nan, 'C']], shape=(156, 12), dtype=object)

###열 추출하기

In [37]:
age=titanic_df['age'] # Series 객체는 1차원 배열(ndarray)과 호환됨
print(type(age))
age

<class 'pandas.core.series.Series'>

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
151    22.0
152    55.5
153    40.5
154     NaN
155    51.0
Name: age, Length: 156, dtype: float64

##4. 데이터 정렬하기
###인덱스 기준으로 정렬하기

In [38]:
## 주로 사용하지 x

titanic_df.sort_index( )

,passengerId,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
151,152,1,1,"Pears, Mrs. Thomas (Edith Wearne)",female,22.0,1,0,113776,66.6000,C2,S
152,153,0,3,"Meo, Mr. Alfonzo",male,55.5,0,0,A.5. 11206,8.0500,NaN,S
153,154,0,3,"van Billiard, Mr. Austin Blyler",male,40.5,0,2,A/5. 851,14.5000,NaN,S
154,155,0,3,"Olsen, Mr. Ole Martin",male,NaN,0,0,Fa 265302,7.3125,NaN,S
155,156,0,1,"Williams, Mr. Charles Duane",male,51.0,0,1,PC 17597,61.3792,NaN,C

###열 기준으로 정렬하기

In [39]:
## 자주 활용 (위의꺼보단)

titanic_df.sort_values(by='age') # 오름차순 정렬
titanic_df.sort_values(by='age', ascending=False) # 내림차순 정렬

,passengerId,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
96,97,0,1,"Goldschmidt, Mr. George B",male,71.0,0,0,PC 17754,34.6542,A5,C
116,117,0,3,"Connors, Mr. Patrick",male,70.5,0,0,370369,7.7500,NaN,Q
33,34,0,2,"Wheadon, Mr. Edward H",male,66.0,0,0,C.A. 24579,10.5000,NaN,S
54,55,0,1,"Ostby, Mr. Engelhart Cornelius",male,65.0,0,1,113509,61.9792,B30,C
94,95,0,3,"Coxon, Mr. Daniel",male,59.0,0,0,364500,7.2500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
121,122,0,3,"Moore, Mr. Leonard Charles",male,NaN,0,0,A4. 54510,8.0500,NaN,S
126,127,0,3,"McMahon, Mr. Martin",male,NaN,0,0,370372,7.7500,NaN,Q
128,129,1,3,"Peter, Miss. Anna",female,NaN,1,1,2668,22.3583,F E69,C
140,141,0,3,"Boulos, Mrs. Joseph (Sultana)",female,NaN,0,2,2678,15.2458,NaN,C
154,155,0,3,"Olsen, Mr. Ole Martin",male,NaN,0,0,Fa 265302,7.3125,NaN,S

In [40]:
titanic_df.sort_values(by=['age', 'pclass']) # 오름차순 정렬
titanic_df.sort_values(by=['age', 'pclass'], ascending=False) # 내림차순 정렬

,passengerId,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
96,97,0,1,"Goldschmidt, Mr. George B",male,71.0,0,0,PC 17754,34.6542,A5,C
116,117,0,3,"Connors, Mr. Patrick",male,70.5,0,0,370369,7.7500,NaN,Q
33,34,0,2,"Wheadon, Mr. Edward H",male,66.0,0,0,C.A. 24579,10.5000,NaN,S
54,55,0,1,"Ostby, Mr. Engelhart Cornelius",male,65.0,0,1,113509,61.9792,B30,C
94,95,0,3,"Coxon, Mr. Daniel",male,59.0,0,0,364500,7.2500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
154,155,0,3,"Olsen, Mr. Ole Martin",male,NaN,0,0,Fa 265302,7.3125,NaN,S
17,18,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13.0000,NaN,S
31,32,1,1,"Spencer, Mrs. William Augustus (Marie Eugenie)",female,NaN,1,0,PC 17569,146.5208,B78,C
55,56,1,1,"Woolner, Mr. Hugh",male,NaN,0,0,19947,35.5000,C52,S
64,65,0,1,"Stewart, Mr. Albert A",male,NaN,0,0,PC 17605,27.7208,NaN,C

###<여기서 잠깐>KeyError

In [41]:
titanic_df[0] # KeyError
titanic_df[3,1] # KeyError
titanic_df[3,:] # KeyError

KeyError: 0

##5. 데이터 가져오기
### 지정 범위의 행에서 데이터 가져오기

### 데이터 가져오기
### 지정한 범위의 행에서 데이터 가져오기
- 기초 문법 슬라이싱 원리와 동일

In [ ]:
titanic_df[0:5] # titanic_df.head(  )와 실행 결과 동일함
titanic_df[0:1] # 첫 행만 가져오기
titanic_df[::3] # 3개씩 건너서 출력함
titanic_df[::-1] # 행의 순서를 거꾸로 출력함

###단순 인덱스로 범위 지정해 데이터 가져오기

In [42]:
titanic_df[:3]

,passengerId,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

###지정 범위의 열에서 데이터 가져오기

In [43]:
len(titanic_df.columns)

12

In [44]:
## 굳이 이런 코드를 쓰는 이유 : 자동화 때문
## 반복문 작업
## 인덱스도 좋지만 컬럼명을 작성하는 게 좋음

titanic_df[titanic_df.columns[0]] # 첫 번째(0번) 열을 1차원 배열의 Series 객체로 추출

0        1
1        2
2        3
3        4
4        5
      ...
151    152
152    153
153    154
154    155
155    156
Name: passengerId, Length: 156, dtype: int64

In [45]:
titanic_df[titanic_df.columns[11]] # 마지막 열을 1차원 배열의 Series 객체로 추출
# titanic_df[titanic_df.columns[-1]] # 혹은 [-1]로 표시

0      S
1      C
2      S
3      S
4      S
      ..
151    S
152    S
153    S
154    S
155    C
Name: embarked, Length: 156, dtype: object

###열 이름으로 데이터 가져오기

In [46]:
age=titanic_df['age']
print(type(age))

<class 'pandas.core.series.Series'>

In [47]:
titanic_df['age'] # 'age' 열을 1차원 배열인 Series 객체로 추출

## 비추 방법 : age 자리에 오는 것이 의미가 애매함. (어떤 걸 의미하는지 모름)
titanic_df.age

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
151    22.0
152    55.5
153    40.5
154     NaN
155    51.0
Name: age, Length: 156, dtype: float64

###열 이름과 위치를 이용해 데이터 가져오기

In [48]:
print(titanic_df[titanic_df.columns[0]][0]) # 첫 번째 열의 첫 번째 값
print(titanic_df['age'][0]) # age 열의 첫 번째 값
print(titanic_df[titanic_df.columns[0]][2])
print(titanic_df[titanic_df.columns[-1]][0])
type(titanic_df[titanic_df.columns[0]][0]) # str

1
22.0
3
S

numpy.int64

In [49]:
titanic_df[titanic_df.columns[0]][2:6] # 2번부터 5번 행까지
titanic_df[titanic_df.columns[0]][:-1] # 마지막 행 제외
titanic_df[titanic_df.columns[0]][::3] # 3개의 step으로 슬라이싱
titanic_df[titanic_df.columns[0]][-1:] # 마지막 행만 추출
titanic_df[titanic_df.columns[0]][::-1] # 행을 역순으로 출력

155    156
154    155
153    154
152    153
151    152
      ...
4        5
3        4
2        3
1        2
0        1
Name: passengerId, Length: 156, dtype: int64

In [50]:
titanic_df['pclass'] # return 값은 시리즈
# 위와 다른 점은 중첩리스트
titanic_df[['pclass']] # return 값은 데이터프레임 

## 시리즈와 데이터프레임 차이점 알아두기

     pclass
0         3
1         1
2         3
3         1
4         3
..      ...
151       1
152       3
153       3
154       3
155       1

[156 rows x 1 columns]

In [51]:
titanic_df[['pclass', 'name', 'sex']] # DataFrame 추출

## 매우 비추
titanic_df[[titanic_df.columns[2],titanic_df.columns[3],titanic_df.columns[4]]]
 # DataFrame 추출

     pclass                                               name     sex
0         3                            Braund, Mr. Owen Harris    male
1         1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female
2         3                             Heikkinen, Miss. Laina  female
3         1       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female
4         3                           Allen, Mr. William Henry    male
..      ...                                                ...     ...
151       1                  Pears, Mrs. Thomas (Edith Wearne)  female
152       3                                   Meo, Mr. Alfonzo    male
153       3                    van Billiard, Mr. Austin Blyler    male
154       3                              Olsen, Mr. Ole Martin    male
155       1                        Williams, Mr. Charles Duane    male

[156 rows x 3 columns]

In [52]:
titanic_df[[titanic_df.columns[2],titanic_df.columns[3],titanic_df.columns[4]]][2:15:3]
# 슬라이싱

    pclass                                               name     sex
2        3                             Heikkinen, Miss. Laina  female
5        3                                   Moran, Mr. James    male
8        3  Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  female
11       1                           Bonnell, Miss. Elizabeth  female
14       3               Vestrom, Miss. Hulda Amanda Adolfina  female

In [53]:
print(titanic_df[titanic_df.columns[0]][0])
print(titanic_df[titanic_df.columns[0]][2])
# print(titanic_df[titanic_df.columns[0]][-1]) # 실행 시 오류 발생
type(titanic_df[titanic_df.columns[0]][0])

1
3

numpy.int64

###인덱스 이름을 기준으로 데이터 가져오기: loc 속성

중요

### loc 중요
- 인덱스 지정이 아닌 특정 행, 열 이름을 지정해야 함.

In [54]:
temp_df = titanic_df.set_index('name')
temp_df # name이 아래 적힘

,passengerId,survived,pclass,sex,age,sibsp,parch,ticket,fare,cabin,embarked
name,,,,,,,,,,,
"Braund, Mr. Owen Harris",1,0,3,male,22.0,1,0,A/5 21171,7.2500,NaN,S
"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",2,1,1,female,38.0,1,0,PC 17599,71.2833,C85,C
"Heikkinen, Miss. Laina",3,1,3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
"Futrelle, Mrs. Jacques Heath (Lily May Peel)",4,1,1,female,35.0,1,0,113803,53.1000,C123,S
"Allen, Mr. William Henry",5,0,3,male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
"Pears, Mrs. Thomas (Edith Wearne)",152,1,1,female,22.0,1,0,113776,66.6000,C2,S
"Meo, Mr. Alfonzo",153,0,3,male,55.5,0,0,A.5. 11206,8.0500,NaN,S
"van Billiard, Mr. Austin Blyler",154,0,3,male,40.5,0,2,A/5. 851,14.5000,NaN,S
"Olsen, Mr. Ole Martin",155,0,3,male,NaN,0,0,Fa 265302,7.3125,NaN,S
"Williams, Mr. Charles Duane",156,0,1,male,51.0,0,1,PC 17597,61.3792,NaN,C

In [55]:
#temp_df.loc[0] # keyerror # 인덱스로 지정했기 때문.

temp_df.loc['Braund, Mr. Owen Harris'] # loc함수는 직접 이름명을 지정해야 출력이 가능함

passengerId            1
survived               0
pclass                 3
sex                 male
age                 22.0
sibsp                  1
parch                  0
ticket         A/5 21171
fare                7.25
cabin                NaN
embarked               S
Name: Braund, Mr. Owen Harris, dtype: object

In [56]:
temp_df.iloc[0] # iloc의 경우 인덱스 번호로 출력이 가능

passengerId            1
survived               0
pclass                 3
sex                 male
age                 22.0
sibsp                  1
parch                  0
ticket         A/5 21171
fare                7.25
cabin                NaN
embarked               S
Name: Braund, Mr. Owen Harris, dtype: object

In [57]:
titanic_df.loc[0]

passengerId                          1
survived                             0
pclass                               3
name           Braund, Mr. Owen Harris
sex                               male
age                               22.0
sibsp                                1
parch                                0
ticket                       A/5 21171
fare                              7.25
cabin                              NaN
embarked                             S
Name: 0, dtype: object

In [58]:
## 이름으로 인덱싱

temp_df.loc['Braund, Mr. Owen Harris' : 'Heikkinen, Miss. Laina'] # braund부터 heikkinen까지 출력
#temp_Df.loc[0:2] # keyerror

,passengerId,survived,pclass,sex,age,sibsp,parch,ticket,fare,cabin,embarked
name,,,,,,,,,,,
"Braund, Mr. Owen Harris",1,0,3,male,22.0,1,0,A/5 21171,7.2500,NaN,S
"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",2,1,1,female,38.0,1,0,PC 17599,71.2833,C85,C
"Heikkinen, Miss. Laina",3,1,3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [59]:
titanic_df.loc[0:5]

,passengerId,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q

In [60]:
print(titanic_df.index)

RangeIndex(start=0, stop=156, step=1)

In [61]:
titanic_df.loc[0:10:2]

,passengerId,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S

In [62]:
type(titanic_df)

pandas.core.frame.DataFrame

In [63]:
type(temp_df)

pandas.core.frame.DataFrame

In [64]:
titanic_df.loc[:, 'age']

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
151    22.0
152    55.5
153    40.5
154     NaN
155    51.0
Name: age, Length: 156, dtype: float64

In [65]:
titanic_df.loc[:, ['age', 'sex']]

      age     sex
0    22.0    male
1    38.0  female
2    26.0  female
3    35.0  female
4    35.0    male
..    ...     ...
151  22.0  female
152  55.5    male
153  40.5    male
154   NaN    male
155  51.0    male

[156 rows x 2 columns]

In [66]:
titanic_df.loc[3:7, ['age', 'sex']]

    age     sex
3  35.0  female
4  35.0    male
5   NaN    male
6  54.0    male
7   2.0    male

In [67]:
titanic_df.loc[2:5, 'survived':'age']

,survived,pclass,name,sex,age
2,1,3,"Heikkinen, Miss. Laina",female,26.0
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0
4,0,3,"Allen, Mr. William Henry",male,35.0
5,0,3,"Moran, Mr. James",male,NaN

###인덱스 순서를 기준으로 데이터 가져오기: iloc 속성

In [68]:
titanic_df.iloc[0]

passengerId                          1
survived                             0
pclass                               3
name           Braund, Mr. Owen Harris
sex                               male
age                               22.0
sibsp                                1
parch                                0
ticket                       A/5 21171
fare                              7.25
cabin                              NaN
embarked                             S
Name: 0, dtype: object

In [69]:
titanic_df.iloc[0:5]

,passengerId,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [70]:
titanic_df.iloc[0:10:3]

,passengerId,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [71]:
titanic_df.iloc[:, [0, 2]]

     passengerId  pclass
0              1       3
1              2       1
2              3       3
3              4       1
4              5       3
..           ...     ...
151          152       1
152          153       3
153          154       3
154          155       3
155          156       1

[156 rows x 2 columns]

In [72]:
titanic_df.iloc[1:5, [0, 2]]

   passengerId  pclass
1            2       1
2            3       3
3            4       1
4            5       3

In [73]:
titanic_df.iloc[1:5, 1:4]

   survived  pclass                                               name
1         1       1  Cumings, Mrs. John Bradley (Florence Briggs Th...
2         1       3                             Heikkinen, Miss. Laina
3         1       1       Futrelle, Mrs. Jacques Heath (Lily May Peel)
4         0       3                           Allen, Mr. William Henry

###피벗 테이블을 이용해 데이터 가져오기

In [74]:
import seaborn as sns
import pandas as pd

tips = sns.load_dataset('tips')
pivot_df = pd.pivot_table(
    tips,
    values='tip', # 집계할 값
    index='sex', # 행 
    columns = 'smoker', # 열
    aggfunc = 'mean', # 집계함수
    observed = True
)
pivot_df

smoker       Yes        No
sex
Male    3.051167  3.113402
Female  2.931515  2.773519

In [75]:
tips.groupby(['sex','smoker'],observed=True)['tip'].mean().unstack()

smoker       Yes        No
sex
Male    3.051167  3.113402
Female  2.931515  2.773519

##### 대기업 분석가
1. sql -> groupby, 서브쿼리, 윈도우함수
2. excel
3. 회사 (python , r, 테블로)

In [76]:
titanic_df.pivot_table(index='pclass', columns='sex', values='survived')

sex       female      male
pclass
1       1.000000  0.142857
2       0.916667  0.166667
3       0.571429  0.131148

In [77]:
# 주피터 노트북 사용자
!pip install numpy

Requirement already satisfied: numpy in c:\users\82103\onedrive\바탕 화면\논문 + 필기 + 대외\lg u+ why not sw camp 부트캠프\lgsw_part02\lgsw02\venv\lib\site-packages (2.2.4)

In [78]:
import numpy as np # mean 함수를 사용하기 위해 numpy를 import

# aggfunc에서 자기가 정의한 사용자 정의함수 (udf: user defined function)도 추가할 수 있음
titanic_df.pivot_table(index='pclass', columns='sex', values='survived', aggfunc=np.mean)

C:\Users\82103\AppData\Local\Temp\ipykernel_10008\2007994317.py:4: FutureWarning: The provided callable <function mean at 0x000001DDCAD3C2C0> is currently using DataFrameGroupBy.mean. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "mean" instead.
  titanic_df.pivot_table(index='pclass', columns='sex', values='survived', aggfunc=np.mean)

sex       female      male
pclass
1       1.000000  0.142857
2       0.916667  0.166667
3       0.571429  0.131148

In [79]:
import numpy as np
titanic_df.pivot_table(index='pclass', columns='sex', values='survived', aggfunc=np.sum)

C:\Users\82103\AppData\Local\Temp\ipykernel_10008\2033707385.py:2: FutureWarning: The provided callable <function sum at 0x000001DDCAD1EE80> is currently using DataFrameGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  titanic_df.pivot_table(index='pclass', columns='sex', values='survived', aggfunc=np.sum)

sex     female  male
pclass
1            9     3
2           11     3
3           20     8

###그룹으로 묶어서 데이터 가져오기

In [80]:
titanic_df.head( )

,passengerId,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [81]:
titanic_df.groupby('survived').count( ) # 결측치 체크하고 싶을 때 활용 # survived 기준으로 결측치 확인

,passengerId,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
survived,,,,,,,,,,,
0,102,102,102,102,85,102,102,102,102,14,102
1,54,54,54,54,41,54,54,54,54,17,53

In [82]:
## 왜 survived 기준?

## 분석할 때 기준변수 : 종속변수 선정
## 종속변수 선정이 분석 주제와 직접적인 연관성이 있다고 보면 됨.

## 타이타닉은 생존여부가 가장 중요한 것이기 때문에 survived 변수를 기준으로 삼음.
## 다른 주제로는 sex, age 등이 있음. 그런데 이런 변수들의 연관성은 survived와 연관이 있음.

In [83]:
titanic_df.groupby('survived').mean( )

TypeError: agg function failed [how->mean,dtype->object]

In [86]:
# xxxxxxxx
titanic_df.groupby('sex').sum( )

,passengerId,survived,pclass,name,age,sibsp,parch,ticket,fare,cabin,embarked
sex,,,,,,,,,,,
female,3815,40,138,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1150.00,49,29,PC 17599STON/O2. 3101282113803347742237736PP 9...,1593.7958,C85C123G6C103B78D33B28F33C23 C25 C27E101F E69D...,CSSSCSSSSSCQSSQCQSCSSCQQSCSSSSSSSQSSSSSSQCSCSS...
male,8431,14,240,"Braund, Mr. Owen HarrisAllen, Mr. William Henr...",2395.83,47,33,A/5 2117137345033087717463349909A/5. 215134708...,2791.2998,E46D56A6C23 C25 C27B30C52C83F G73E31A5D10 D12D...,SSQSSSSQSSSSCSSCSCSCSCSQCSSCSCSCSSCCSSSSCSSSSS...

In [87]:
titanic_df.groupby('sex')['survived'].mean( )

sex
female    0.714286
male      0.140000
Name: survived, dtype: float64

In [89]:
## typeerror
## str type과 int type 혼용으로 인한 에러
titanic_df.groupby(['sex', 'survived']).mean( )

TypeError: agg function failed [how->mean,dtype->object]

##6. 데이터 재구조화하기
###stack과 unstack

In [90]:
df = titanic_df.groupby(['sex', 'survived']).mean()
df

TypeError: agg function failed [how->mean,dtype->object]

In [91]:
df.unstack('sex')

NameError: name 'df' is not defined

In [92]:
df.unstack('survived')

NameError: name 'df' is not defined

In [93]:
survived=df.unstack('survived')
survived_stack=survived.stack('survived')
survived_stack

NameError: name 'df' is not defined

In [97]:
tips.head(1)

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2

In [100]:
df2 = tips.groupby(['sex','size'], observed=True)['tip'].mean()
df2

sex     size
Male    1       1.920000
        2       2.614184
        3       3.476667
        4       4.172143
        5       3.750000
        6       5.850000
Female  1       1.276667
        2       2.528448
        3       3.250000
        4       4.021111
        5       5.140000
        6       4.600000
Name: tip, dtype: float64

In [104]:
## 중요

df2.unstack('sex') # size는 행으로 떨어짐

sex       Male    Female
size
1     1.920000  1.276667
2     2.614184  2.528448
3     3.476667  3.250000
4     4.172143  4.021111
5     3.750000  5.140000
6     5.850000  4.600000

In [108]:
df2_unstack = df2.unstack('size')
df2_unstack.stack('size') # 되돌리기

sex     size
Male    1       1.920000
        2       2.614184
        3       3.476667
        4       4.172143
        5       3.750000
        6       5.850000
Female  1       1.276667
        2       2.528448
        3       3.250000
        4       4.021111
        5       5.140000
        6       4.600000
dtype: float64

###인덱스 초기화하기: reset_index 함수

In [110]:
## 조건 필터링 이후에 reset_index(drop = True)

In [112]:
tips.loc[tips['size']==4, :].reset_index().head(2)

   index  total_bill   tip     sex smoker  day    time  size
0      4       24.59  3.61  Female     No  Sun  Dinner     4
1      5       25.29  4.71    Male     No  Sun  Dinner     4

In [113]:
tips.loc[tips['size']==4, :].reset_index(drop = True).head(2)

   total_bill   tip     sex smoker  day    time  size
0       24.59  3.61  Female     No  Sun  Dinner     4
1       25.29  4.71    Male     No  Sun  Dinner     4

In [114]:
## groupby 이후에는 멀티인덱스 현상이 발생해 깔끔하게 데이터프레임으로 만들기 위해 reset_index()

In [109]:
df1=df.reset_index( )
df1

NameError: name 'df' is not defined

In [ ]:
## 잘 안씀
## 객체 update하는 거라 재실행 시 오류날 가능성 높음
df.reset_index(inplace=True)
df

## 7. 데이터프레임 합치기

In [115]:
import pandas as pd
url='https://github.com/sehakflower/data/blob/main/titanic_1309.xlsx?raw=true'
titanic=pd.read_excel(url, sheet_name='total')
titanic

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,3,0,"Zabour, Miss. Hileni",female,14.5000,1,0,2665,14.4542,NaN,C,NaN,328.0,NaN
1305,3,0,"Zabour, Miss. Thamine",female,NaN,1,0,2665,14.4542,NaN,C,NaN,NaN,NaN
1306,3,0,"Zakarian, Mr. Mapriededer",male,26.5000,0,0,2656,7.2250,NaN,C,NaN,304.0,NaN
1307,3,0,"Zakarian, Mr. Ortin",male,27.0000,0,0,2670,7.2250,NaN,C,NaN,NaN,NaN
1308,3,0,"Zimmerman, Mr. Leo",male,29.0000,0,0,315082,7.8750,NaN,S,NaN,NaN,NaN

In [116]:
# 행으로 분리
# 100개 훈련데이터, 309개의 테스트 데이터

train_1000=titanic.iloc[:1000]
test_309=titanic.iloc[1000:]
len(train_1000), len(test_309)

(1000, 309)

###파일 내보내기
- dataset으로

In [117]:
train_1000.to_csv('dataset/train_1000.csv')
test_309.to_csv('dataset/test_309.csv')

In [ ]:
# !사용시 cmd 명령어처럼 사용 가능

In [120]:
!pwd

/c/Users/82103/OneDrive/바탕 화면/논문 + 필기 + 대외/LG U+ Why Not SW Camp 부트캠프/LGSW_part02/LGSW02/chapter6

In [121]:
!ls

Chapter 06_판다스를 활용한 데이터 전처리 1.ipynb
dataset
file.txt
file_io.ipynb
hello.txt
proverb.txt

In [122]:
pd.read_csv('dataset/train_1000.csv')

,Unnamed: 0,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,995,3,0,"Markoff, Mr. Marin",male,35.0000,0,0,349213,7.8958,NaN,C,NaN,NaN,NaN
996,996,3,0,"Markun, Mr. Johann",male,33.0000,0,0,349257,7.8958,NaN,S,NaN,NaN,NaN
997,997,3,1,"Masselmani, Mrs. Fatima",female,NaN,0,0,2649,7.2250,NaN,C,C,NaN,NaN
998,998,3,0,"Matinoff, Mr. Nicola",male,NaN,0,0,349255,7.8958,NaN,C,NaN,NaN,NaN
999,999,3,1,"McCarthy, Miss. Catherine ""Katie""",female,NaN,0,0,383123,7.7500,NaN,Q,15 16,NaN,NaN

###데이터 합치기: concat 함수

In [123]:
total_df=pd.concat([train_1000, test_309]) # 옵션 없으면 axis=0
total_df=pd.concat([train_1000, test_309], axis=0) # 위아래로 붙일 때는 axis=0
total_df

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,3,0,"Zabour, Miss. Hileni",female,14.5000,1,0,2665,14.4542,NaN,C,NaN,328.0,NaN
1305,3,0,"Zabour, Miss. Thamine",female,NaN,1,0,2665,14.4542,NaN,C,NaN,NaN,NaN
1306,3,0,"Zakarian, Mr. Mapriededer",male,26.5000,0,0,2656,7.2250,NaN,C,NaN,304.0,NaN
1307,3,0,"Zakarian, Mr. Ortin",male,27.0000,0,0,2670,7.2250,NaN,C,NaN,NaN,NaN
1308,3,0,"Zimmerman, Mr. Leo",male,29.0000,0,0,315082,7.8750,NaN,S,NaN,NaN,NaN

In [125]:

total_df=pd.concat([train_1000, test_309], axis=1)
total_df.shape
# axis=1일 경우 컬럼의 수가 늘어남.
# 옆으로 증가하는 느낌

# axis=0은 아래로 붙는 느낌.

(1309, 28)

In [ ]:
total_df=pd.concat([train_1000, test_309])
total_df=pd.concat([train_1000, test_309], axis=1)
total_df

https://r4ds.hadley.nz/joins.html

In [140]:
df1 = pd.DataFrame({
    'key': ['K0', 'K1', 'K2'],
    'A': ['A0', 'A1', 'A2'],
    'B': ['B0', 'B1', 'B2']
})

df2 = pd.DataFrame({
    'key': ['K0', 'K2', 'K3'],
    'C': ['C0', 'C2', 'C3'],
    'D': ['D0', 'D2', 'D3']
})

In [129]:
## pandas : merge, join

## inner merge
result1 = pd.merge(df1, df2, on = 'key', how = 'inner')
print("inner join")
print(result1)

inner join
  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K2  A2  B2  C2  D2

In [134]:
## left merge

result2 = pd.merge(df1, df2, on = 'key', how = 'left')
print('left join') # 매칭이 안된 값은 NaN
print(result2)
#result2

left join
  key   A   B    C    D
0  K0  A0  B0   C0   D0
1  K1  A1  B1  NaN  NaN
2  K2  A2  B2   C2   D2

In [137]:
## right merge

result3 = pd.merge(df1, df2, on = 'key', how = 'right')
print('right join') # 매칭이 안된 값은 NaN
print(result3)

right join
  key    A    B   C   D
0  K0   A0   B0  C0  D0
1  K2   A2   B2  C2  D2
2  K3  NaN  NaN  C3  D3

In [138]:
## full merge

result4 = pd.merge(df1, df2, on = 'key', how = 'outer')
print('full join') # 매칭이 안된 값은 NaN
print(result4)

full join
  key    A    B    C    D
0  K0   A0   B0   C0   D0
1  K1   A1   B1  NaN  NaN
2  K2   A2   B2   C2   D2
3  K3  NaN  NaN   C3   D3

In [143]:
## error 상황만 참조
## 굳이 x

df1 = pd.DataFrame({
    'key': ['K0', 'K1', 'K2'],
    'A': ['A0', 'A1', 'A2'],
    'B': ['B0', 'B1', 'B2']
})

df2 = pd.DataFrame({
    'key': ['K0', 'K2', 'K3'],
    'C': ['C0', 'C2', 'C3'],
    'D': ['D0', 'D2', 'D3']
})


result1 = pd.merge(df1, df2, left_index=True, right_on = 'key', how = 'inner')
result1

## 에러 발생 시 join에러 발생 시 매개변수 설명 확인
## merge error

## join error 발생 시
## 매개변수 설명 참조 
## merge, join 하기 전에 key 값 컬럼명을 통일시키기

ValueError: You are trying to merge on int64 and object columns for key 'key'. If you wish to proceed you should use pd.concat

###데이터프레임 병합  : merge 함수

In [144]:
df1=train_1000[['name', 'pclass', 'sex', 'age']]
df1

                                                name  pclass     sex      age
0                      Allen, Miss. Elisabeth Walton       1  female  29.0000
1                     Allison, Master. Hudson Trevor       1    male   0.9167
2                       Allison, Miss. Helen Loraine       1  female   2.0000
3               Allison, Mr. Hudson Joshua Creighton       1    male  30.0000
4    Allison, Mrs. Hudson J C (Bessie Waldo Daniels)       1  female  25.0000
..                                               ...     ...     ...      ...
995                               Markoff, Mr. Marin       3    male  35.0000
996                               Markun, Mr. Johann       3    male  33.0000
997                          Masselmani, Mrs. Fatima       3  female      NaN
998                             Matinoff, Mr. Nicola       3    male      NaN
999                McCarthy, Miss. Catherine "Katie"       3  female      NaN

[1000 rows x 4 columns]

In [145]:
df2=train_1000[['name', 'survived']]
df2

                                                name  survived
0                      Allen, Miss. Elisabeth Walton         1
1                     Allison, Master. Hudson Trevor         1
2                       Allison, Miss. Helen Loraine         0
3               Allison, Mr. Hudson Joshua Creighton         0
4    Allison, Mrs. Hudson J C (Bessie Waldo Daniels)         0
..                                               ...       ...
995                               Markoff, Mr. Marin         0
996                               Markun, Mr. Johann         0
997                          Masselmani, Mrs. Fatima         1
998                             Matinoff, Mr. Nicola         0
999                McCarthy, Miss. Catherine "Katie"         1

[1000 rows x 2 columns]

In [146]:
merge_inner=pd.merge(df1, df2)
merge_inner

,name,pclass,sex,age,survived
0,"Allen, Miss. Elisabeth Walton",1,female,29.0000,1
1,"Allison, Master. Hudson Trevor",1,male,0.9167,1
2,"Allison, Miss. Helen Loraine",1,female,2.0000,0
3,"Allison, Mr. Hudson Joshua Creighton",1,male,30.0000,0
4,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",1,female,25.0000,0
...,...,...,...,...,...
999,"Markoff, Mr. Marin",3,male,35.0000,0
1000,"Markun, Mr. Johann",3,male,33.0000,0
1001,"Masselmani, Mrs. Fatima",3,female,NaN,1
1002,"Matinoff, Mr. Nicola",3,male,NaN,0
1003,"McCarthy, Miss. Catherine ""Katie""",3,female,NaN,1

In [147]:
df2.loc[[0,2,3], ['name']] = ''
df2=df2[:10]
df1=df1[:10]
merge_inner=pd.merge(df1, df2, how='inner', on='name')
merge_inner

,name,pclass,sex,age,survived
0,"Allison, Master. Hudson Trevor",1,male,0.9167,1
1,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",1,female,25.0000,0
2,"Anderson, Mr. Harry",1,male,48.0000,1
3,"Andrews, Miss. Kornelia Theodosia",1,female,63.0000,1
4,"Andrews, Mr. Thomas Jr",1,male,39.0000,0
5,"Appleton, Mrs. Edward Dale (Charlotte Lamson)",1,female,53.0000,1
6,"Artagaveytia, Mr. Ramon",1,male,71.0000,0

In [148]:
merge_outer = pd.merge(df1,df2, how='outer',on='name')
merge_outer

,name,pclass,sex,age,survived
0,,NaN,NaN,NaN,1.0
1,,NaN,NaN,NaN,0.0
2,,NaN,NaN,NaN,0.0
3,"Allen, Miss. Elisabeth Walton",1.0,female,29.0000,NaN
4,"Allison, Master. Hudson Trevor",1.0,male,0.9167,1.0
5,"Allison, Miss. Helen Loraine",1.0,female,2.0000,NaN
6,"Allison, Mr. Hudson Joshua Creighton",1.0,male,30.0000,NaN
7,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",1.0,female,25.0000,0.0
8,"Anderson, Mr. Harry",1.0,male,48.0000,1.0
9,"Andrews, Miss. Kornelia Theodosia",1.0,female,63.0000,1.0
10,"Andrews, Mr. Thomas Jr",1.0,male,39.0000,0.0
11,"Appleton, Mrs. Edward Dale (Charlotte Lamson)",1.0,female,53.0000,1.0
12,"Artagaveytia, Mr. Ramon",1.0,male,71.0000,0.0

In [151]:
merge_left=pd.merge(df1, df2, how='left', left_on='name', right_on='name')
# 컬럼명이 같으면 굳이 left_on, right_on 사용 x
merge_left

,name,pclass,sex,age,survived
0,"Allen, Miss. Elisabeth Walton",1,female,29.0000,NaN
1,"Allison, Master. Hudson Trevor",1,male,0.9167,1.0
2,"Allison, Miss. Helen Loraine",1,female,2.0000,NaN
3,"Allison, Mr. Hudson Joshua Creighton",1,male,30.0000,NaN
4,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",1,female,25.0000,0.0
5,"Anderson, Mr. Harry",1,male,48.0000,1.0
6,"Andrews, Miss. Kornelia Theodosia",1,female,63.0000,1.0
7,"Andrews, Mr. Thomas Jr",1,male,39.0000,0.0
8,"Appleton, Mrs. Edward Dale (Charlotte Lamson)",1,female,53.0000,1.0
9,"Artagaveytia, Mr. Ramon",1,male,71.0000,0.0

In [150]:
merge_right=pd.merge(df1, df2, how='right', left_on='name', right_on='name')
merge_right

,name,pclass,sex,age,survived
0,,NaN,NaN,NaN,1
1,"Allison, Master. Hudson Trevor",1.0,male,0.9167,1
2,,NaN,NaN,NaN,0
3,,NaN,NaN,NaN,0
4,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",1.0,female,25.0000,0
5,"Anderson, Mr. Harry",1.0,male,48.0000,1
6,"Andrews, Miss. Kornelia Theodosia",1.0,female,63.0000,1
7,"Andrews, Mr. Thomas Jr",1.0,male,39.0000,0
8,"Appleton, Mrs. Edward Dale (Charlotte Lamson)",1.0,female,53.0000,1
9,"Artagaveytia, Mr. Ramon",1.0,male,71.0000,0

###데이터프레임 결합  : join 함수

In [156]:
df2.loc[[1], ['name']]='Kildong, Mr. Hong'
df2=df2[:10]
df2

KeyError: "None of [Index([1], dtype='object', name='name')] are in the [index]"

In [154]:
df1.set_index('name', inplace=True)
df2.set_index('name', inplace=True)

KeyError: "None of ['name'] are in the columns"

In [ ]:
df1

In [ ]:
df2

In [157]:
df1.join(df2)

,pclass,sex,age,survived,name
name,,,,,
"Allen, Miss. Elisabeth Walton",1,female,29.0000,NaN,NaN
"Allison, Master. Hudson Trevor",1,male,0.9167,NaN,NaN
"Allison, Miss. Helen Loraine",1,female,2.0000,NaN,NaN
"Allison, Mr. Hudson Joshua Creighton",1,male,30.0000,NaN,NaN
"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",1,female,25.0000,0.0,b''
"Anderson, Mr. Harry",1,male,48.0000,1.0,b''
"Andrews, Miss. Kornelia Theodosia",1,female,63.0000,1.0,b''
"Andrews, Mr. Thomas Jr",1,male,39.0000,0.0,b''
"Appleton, Mrs. Edward Dale (Charlotte Lamson)",1,female,53.0000,1.0,b''
"Artagaveytia, Mr. Ramon",1,male,71.0000,0.0,b''

In [158]:
df1.join(df2, how='inner')

TypeError: void() takes at least 1 positional argument (0 given)

In [159]:
df2.join(df1)

TypeError: ufunc 'isnan' not supported for the input types, and the inputs could not be safely coerced to any supported types according to the casting rule ''safe''

TypeError: ufunc 'isnan' not supported for the input types, and the inputs could not be safely coerced to any supported types according to the casting rule ''safe''

#Section 03. 조건 검색으로 데이터 추출
## 1. 불 인덱스로 조건 검색하기

In [ ]:
titanic_df[titanic_df['age']>70] # 70세 이상인 승객 검색

In [ ]:
titanic_df[titanic_df['age']<3] # 3세 미만인 승객 검색

In [ ]:
titanic_df[titanic_df['age']<3]['name'] # 3세 미만 승객의 이름 검색

In [ ]:
titanic_df[titanic_df['age']<3][['age', 'name']]

##2. loc 속성으로 조건 검색하기

In [ ]:
titanic_df.loc[titanic_df['age']<3]['name'] # 3세 미만 승객의 이름 검색

In [ ]:
titanic_df.loc[titanic_df['age']<3, 'name':'sex']

In [ ]:
titanic_df.loc[titanic_df['age']<3, ['name', 'sex']]

##3. isin 함수로 조건 검색하기

In [161]:
my_condition=['male']
my_condition

['male']

In [162]:
titanic_df['sex'].isin(my_condition)

0       True
1      False
2      False
3      False
4       True
       ...
151    False
152     True
153     True
154     True
155     True
Name: sex, Length: 156, dtype: bool

In [163]:
titanic_df['name']

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
151                    Pears, Mrs. Thomas (Edith Wearne)
152                                     Meo, Mr. Alfonzo
153                      van Billiard, Mr. Austin Blyler
154                                Olsen, Mr. Ole Martin
155                          Williams, Mr. Charles Duane
Name: name, Length: 156, dtype: object

In [164]:
my_condition1=['Braund, Mr. Owen Harris', 'Williams, Mr. Charles Duane']
my_condition1

['Braund, Mr. Owen Harris', 'Williams, Mr. Charles Duane']

In [165]:
titanic_df['name'].isin(my_condition1)

0       True
1      False
2      False
3      False
4      False
       ...
151    False
152    False
153    False
154    False
155     True
Name: name, Length: 156, dtype: bool

## 4. isin 함수와 loc 속성으로 조건 검색하기
- 자주 사용
- 중복 문자열 조회할 때, 자주 사용

In [166]:
titanic_df.loc[titanic_df['name'].isin(my_condition1)]

,passengerId,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
155,156,0,1,"Williams, Mr. Charles Duane",male,51.0,0,1,PC 17597,61.3792,NaN,C

In [167]:
titanic_df.loc[titanic_df['name'].isin(my_condition1), 'age']

0      22.0
155    51.0
Name: age, dtype: float64

In [168]:
titanic_df.loc[titanic_df['name'].isin(my_condition1), 'name']

0          Braund, Mr. Owen Harris
155    Williams, Mr. Charles Duane
Name: name, dtype: object

In [169]:
titanic_df.loc[titanic_df['name'].isin(my_condition1), 'pclass':'age']

     pclass                         name   sex   age
0         3      Braund, Mr. Owen Harris  male  22.0
155       1  Williams, Mr. Charles Duane  male  51.0

In [170]:
titanic_df.loc[titanic_df['name'].isin(my_condition1), ['pclass', 'age']]

     pclass   age
0         3  22.0
155       1  51.0

##5. 검색 정보를 활용해 타이타닉 승객 구분하기

In [171]:
titanic_df['name'][0]

'Braund, Mr. Owen Harris'

In [172]:
titanic_df['name'][0].split(',')[1]

' Mr. Owen Harris'

In [173]:
titanic_df['name'][0].split(',')[1].split('.')[0]

' Mr'

In [174]:
titanic_df['name'][0].split(',')[1].split('.')[0].strip( )

'Mr'

In [175]:
test=lambda x: x+2
test(2)
range(5) # 0, 1, 2, 3, 4

range(0, 5)

In [176]:
list(map(test, range(5)))

[2, 3, 4, 5, 6]

In [177]:
condition=lambda x: x.split(',')[1].split('.')[0].strip( )
titanic_df['title']=titanic_df['name'].map(condition)
titanic_df['title']

0        Mr
1       Mrs
2      Miss
3       Mrs
4        Mr
       ...
151     Mrs
152      Mr
153      Mr
154      Mr
155      Mr
Name: title, Length: 156, dtype: object

In [178]:
titles=titanic_df['title'].unique( )
titles

array(['Mr', 'Mrs', 'Miss', 'Master', 'Don', 'Rev'], dtype=object)

In [180]:
Special=[ 'Master', 'Don', 'Rev']
for each in Special:
  titanic_df['title']=titanic_df['title'].replace(each, 'Special')
  
titanic_df['title'].unique( )

array(['Mr', 'Mrs', 'Miss', 'Special'], dtype=object)

In [181]:
print(titanic_df[['title', 'survived']].groupby(['title'], as_index=False).mean( ))

     title  survived
0     Miss  0.705882
1       Mr  0.123596
2      Mrs  0.727273
3  Special  0.272727